TYPE_MAP = {
    "ERR": "エラー",
    "WRN": "警告"
}

PROCESSING_MAP = {
    "01": "データ抽出",
    "02": "要約処理",
    "03": "分類処理"
}

CATEGORY_MAP = {
    "1": "システムエラー",
    "2": "業務エラー"
}

MODULE_MAP = {
    "001": "S3",
    "002": "DB",
    "003": "Secrets",
    "004": "Florence",
    "005": "Bedrock",
    "006": "その他"
}

ERROR_MESSAGE_MAP = {
    "001": "指定する対象取得できない",
    "002": "指定する対象更新できない",
    "003": "APIエラー",
    "004": "アクセスできない",
    "005": "トーケン数は制限値よりオーバーする",
    "006": "API Timeout",
    "007": "指定する時間範囲内の対象データ不存在",
    "008": "処理対象データが不正",
    "009": "要約できない",
    "010": "分類できない",
    "011": "検索結果がブランク或いは０件",
    "012": "ありえない大中小細分類結果がある",
    "013": "指定する範囲外の分類結果がある"
}
